app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.order(created_at: :desc)
---
SELECT "drivers".* FROM "drivers" ORDER BY "drivers"."created_at" DESC

  def create
    @driver = Driver.new(driver_params)

    respond_to do |format|
      if @driver.save
---
INSERT INTO "drivers" ("name", "surname", "birth_date", "tc_no", "phone", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_driver
      @driver = Driver.find(params[:id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]