app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" ORDER BY "vehicles"."created_at" DESC
---
  def index
    @vehicles = Vehicle.order(created_at: :desc)

INSERT INTO "vehicles" ("name", "code", "vehicle_class", "brand", "model", "model_year", "fuel_capacity", "fuel_type", "purchase_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])