app/views/vehicles/_form.html.erb

SELECT  "drivers".* FROM "drivers" ORDER BY "drivers"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
        <%= form.label "eray" %>
        <%= form.select :driver_id, avaliable_driver, "initial-text" => @vehicle.driver_id, "initial-id" => @vehicle.driver_id %>